logs/benchmark_20250709_205425/h3_100ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 20:58:56
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 2000 total requests
spawning thread #1: 5 total client(s). 2000 total requests
spawning thread #2: 5 total client(s). 2000 total requests
spawning thread #3: 5 total client(s). 2000 total requests
spawning thread #4: 5 total client(s). 2000 total requests
spawning thread #5: 5 total client(s). 2000 total requests
spawning thread #6: 5 total client(s). 2000 total requests
spawning thread #7: 5 total client(s). 2000 total requests
spawning thread #8: 5 total client(s). 2000 total requests
spawning thread #9: 5 total client(s). 2000 total requests
spawning thread #10: 5 total client(s). 2000 total requests
spawning thread #11: 5 total client(s). 2000 total requests
spawning thread #12: 5 total client(s). 2000 total requests
spawning thread #13: 5 total client(s). 2000 total requests
spawning thread #14: 5 total client(s). 2000 total requests
spawning thread #15: 5 total client(s). 2000 total requests
spawning thread #16: 5 total client(s). 2000 total requests
spawning thread #17: 5 total client(s). 2000 total requests
spawning thread #18: 5 total client(s). 2000 total requests
spawning thread #19: 5 total client(s). 2000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.07s, 37510.64 req/s, 10.32MB/s
requests: 40000 total, 40000 started, 40000 done, 40000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 40000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 11.01MB (11542108) total, 8.24MB (8637708) headers (space savings 26.80%), 2.37MB (2480000) data
UDP datagram: 7141 sent, 11489 received
                     min         max         mean         sd        +/- sd
time for request:      889us    633.59ms     74.00ms     95.35ms    87.64%
time for connect:    64.78ms       1.03s    105.04ms    161.50ms    97.00%
time to 1st byte:    77.19ms       1.03s    116.67ms    159.77ms    97.00%
req/s           :     376.82     3506.92     1260.35      810.04    84.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 18000 total requests
spawning thread #1: 5 total client(s). 18000 total requests
spawning thread #2: 5 total client(s). 18000 total requests
spawning thread #3: 5 total client(s). 18000 total requests
spawning thread #4: 5 total client(s). 18000 total requests
spawning thread #5: 5 total client(s). 18000 total requests
spawning thread #6: 5 total client(s). 18000 total requests
spawning thread #7: 5 total client(s). 18000 total requests
spawning thread #8: 5 total client(s). 18000 total requests
spawning thread #9: 5 total client(s). 18000 total requests
spawning thread #10: 5 total client(s). 18000 total requests
spawning thread #11: 5 total client(s). 18000 total requests
spawning thread #12: 5 total client(s). 18000 total requests
spawning thread #13: 5 total client(s). 18000 total requests
spawning thread #14: 5 total client(s). 18000 total requests
spawning thread #15: 5 total client(s). 18000 total requests
spawning thread #16: 5 total client(s). 18000 total requests
spawning thread #17: 5 total client(s). 18000 total requests
spawning thread #18: 5 total client(s). 18000 total requests
spawning thread #19: 5 total client(s). 18000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 24.34s, 14785.44 req/s, 4.08MB/s
requests: 360000 total, 360000 started, 360000 done, 359834 succeeded, 166 failed, 166 errored, 0 timeout
status codes: 359834 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 99.32MB (104146276) total, 74.29MB (77893994) headers (space savings 26.77%), 21.28MB (22309708) data
UDP datagram: 41730 sent, 85125 received
                     min         max         mean         sd        +/- sd
time for request:     3.01ms       2.12s    622.58ms    260.82ms    75.18%
time for connect:    80.96ms       1.12s    104.95ms    102.69ms    99.00%
time to 1st byte:    84.85ms       1.29s    125.42ms    118.42ms    99.00%
req/s           :     144.71      159.28      150.04        2.44    84.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 40000
Measurement Requests: 360000
End Time: 2025-07-09 20:59:27
CSV Log: /logs/benchmark_20250709_205425/h3_100ms_1pct.csv